tests/performance/alerts-load.yml
config:
  target: "https://api.weather.gov"
  phases:
    - duration: 10
      arrivalRate: 1
  defaults:
    headers:
      Accept: "application/ld+json, application/json, */*"
      User-Agent: "copilot-playwright-poc-artillery/1.0"

scenarios:
  - name: "GET /alerts smoke load"
    flow:
      - get:
          url: "/alerts"